import random
x = ['стол', 'банан', 'хрен', 'моль', 'барабан', 'вертолет', 'кукурузник',"хроника",
"зал",
"галера",
"балл",
"вес",
"кафель",
"знак",
"фильтр",
"башня",
"кондитер",
"омар",
"чан",
"пламя",
"банк",
"тетерев",
"муж",
"камбала",
"груз",
"кино",
"лаваш",
"калач",
"геолог",
"бальзам",
"бревно",
"жердь",
"борец",
"самовар",
"карабин",
"подлокотник",
"барак",
"мотор",
"шарж",
"сустав",
"амфитеатр",
"скворечник",
"подлодка",
"затычка",
"ресница",
"спичка",
"кабан",
"муфта",
"синоптик",
"характер",
"мафиози",
"фундамент",
"бумажник",
"библиофил",
"дрожжи",
"казино",
"конечность",
"пробор",
"дуст",
"комбинация",
"мешковина",
"процессор",
"крышка",
"сфинкс",
"пассатижи",
"фунт",
"кружево",
"агитатор",
"формуляр",
"прокол",
"абзац",
"караван",
"леденец",
"кашпо",
"баркас",
"кардан",
"вращение",
"заливное",
"метрдотель",
"клавиатура",
"радиатор",
"сегмент",
"обещание",
"магнитофон",
"кордебалет",
"заварушка"]
def getword(x):
    x = (random.choice(x))
    return x


def displayhangman(tries):  # количество попыток
    stages = [  # финальное состояние: голова, торс, обе руки, обе ноги
        '''
           --------
           |      |
           |      O
           |     \\|/
           |      |
           |     / \\
           -
        ''',
        # голова, торс, обе руки, одна нога
        '''
           --------
           |      |
           |      O
           |     \\|/
           |      |
           |     /
           -
        ''',
        # голова, торс, обе руки
        '''
           --------
           |      |
           |      O
           |     \\|/
           |      |
           |
           -
        ''',
        # голова, торс и одна рука
        '''
           --------
           |      |
           |      O
           |     \\|
           |      |
           |
           -
        ''',
        # голова и торс
        '''
           --------
           |      |
           |      O
           |      |
           |      |
           |
           -
        ''',
        # голова
        '''
           --------
           |      |
           |      O
           |
           |
           |
           -
        ''',
        # начальное состояние
        '''
           --------
           |      |
           |
           |
           |
           |
           -
        '''
    ]
    return stages[tries]


def igra():
    word = getword(x)
    ls_word = list(word)
    print(displayhangman(-1))
    word_completion = ['_'] * len(word)
    print('         ', *word_completion)

    tries = 0
    flag = False
    nazw_bykwy =''
    while tries < 6:
        letter = str(input())
        if letter in nazw_bykwy:
            print('Ты уже называл эту букву! Давай другую!')
        if len(letter) >= 2:
            print('Строго одну букву!!')
        if not letter.isalpha():
            print('Вводи букву, а не фигню какую то!')
        else:
            nazw_bykwy = nazw_bykwy + letter
            for c in range(len(word_completion)):
                if letter in word[c]:
                    word_completion[c] = letter
                    Flag = True
                else:

                    Flag = False
            if letter in word:
                print('Угадал!')
                print('           ', *word_completion)
            else:
                tries = tries + 1
                print('Не угадал, пробуй еще!','\n', 'Использовал попыток:', tries, displayhangman(-(tries + 1)) )
                print('           ', *word_completion)

            if tries >= 6:
                print('Попыток больше нет. Тебя повесили, не звони мне больше!','\n', 'А загаданное слово было:', word)
                return
            if ls_word == word_completion:
                print('Ты выиграл! Красавчик')
                return
print(' Итак, игра "Виселица". Твоя задача угадать слово. Оно на русском, с маленькой буквы.','\n',
    'У тебя будет 6 попыток. Называй букву!')
igra()
z = True
while z:
    print('поиграем еще? д/н')
    otwet = str(input())
    if otwet == 'д':
        igra()
    else:
        z = False








